<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introduction" data-toc-modified-id="Introduction-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introduction</a></span></li><li><span><a href="#Installation" data-toc-modified-id="Installation-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Installation</a></span></li><li><span><a href="#Introduction-to-pandas-data-structures" data-toc-modified-id="Introduction-to-pandas-data-structures-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Introduction to pandas data structures</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#Find-NaN-values" data-toc-modified-id="Find-NaN-values-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Find NaN values</a></span></li></ul></li><li><span><a href="#Read/write-data" data-toc-modified-id="Read/write-data-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Read/write data</a></span><ul class="toc-item"><li><span><a href="#We-load-data-in-CSV-format" data-toc-modified-id="We-load-data-in-CSV-format-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>We load data in CSV format</a></span></li><li><span><a href="#We-load-data-in-xlsx-format" data-toc-modified-id="We-load-data-in-xlsx-format-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>We load data in xlsx format</a></span></li><li><span><a href="#We-display-the-first-rows" data-toc-modified-id="We-display-the-first-rows-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>We display the first rows</a></span></li><li><span><a href="#We-display-the-last-rows" data-toc-modified-id="We-display-the-last-rows-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>We display the last rows</a></span></li><li><span><a href="#Visualize-a-random-sample" data-toc-modified-id="Visualize-a-random-sample-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Visualize a random sample</a></span></li></ul></li><li><span><a href="#Exploratory-analysis-of-a-dataframe" data-toc-modified-id="Exploratory-analysis-of-a-dataframe-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Exploratory analysis of a dataframe</a></span></li><li><span><a href="#Basic-operations-with-dataframes" data-toc-modified-id="Basic-operations-with-dataframes-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Basic operations with dataframes</a></span><ul class="toc-item"><li><span><a href="#We-select-a-column" data-toc-modified-id="We-select-a-column-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>We select a column</a></span></li><li><span><a href="#We-select-several-columns" data-toc-modified-id="We-select-several-columns-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>We select several columns</a></span></li><li><span><a href="#Get-the-unique-values-​​of-a-column-(ie-a-Series)" data-toc-modified-id="Get-the-unique-values-​​of-a-column-(ie-a-Series)-6.3"><span class="toc-item-num">6.3&nbsp;&nbsp;</span>Get the unique values ​​of a column (ie a Series)</a></span></li><li><span><a href="#Change-the-data-type-of-a-column" data-toc-modified-id="Change-the-data-type-of-a-column-6.4"><span class="toc-item-num">6.4&nbsp;&nbsp;</span>Change the data type of a column</a></span></li><li><span><a href="#We-filter-the-data-by-the-value-of-the-columns" data-toc-modified-id="We-filter-the-data-by-the-value-of-the-columns-6.5"><span class="toc-item-num">6.5&nbsp;&nbsp;</span>We filter the data by the value of the columns</a></span></li><li><span><a href="#Copy-a-dataframe-and-rename-columns" data-toc-modified-id="Copy-a-dataframe-and-rename-columns-6.6"><span class="toc-item-num">6.6&nbsp;&nbsp;</span>Copy a dataframe and rename columns</a></span><ul class="toc-item"><li><span><a href="#Rename-columns" data-toc-modified-id="Rename-columns-6.6.1"><span class="toc-item-num">6.6.1&nbsp;&nbsp;</span>Rename columns</a></span></li><li><span><a href="#We-can-rename-the-columns-by-crushing-the-instance-attribute...-does-this-ring-a-bell?" data-toc-modified-id="We-can-rename-the-columns-by-crushing-the-instance-attribute...-does-this-ring-a-bell?-6.6.2"><span class="toc-item-num">6.6.2&nbsp;&nbsp;</span>We can rename the columns by crushing the instance attribute... does this ring a bell?</a></span></li></ul></li><li><span><a href="#delete-columns" data-toc-modified-id="delete-columns-6.7"><span class="toc-item-num">6.7&nbsp;&nbsp;</span>delete columns</a></span></li><li><span><a href="#delete-rows" data-toc-modified-id="delete-rows-6.8"><span class="toc-item-num">6.8&nbsp;&nbsp;</span>delete rows</a></span></li><li><span><a href="#Reset_index-and-set_index" data-toc-modified-id="Reset_index-and-set_index-6.9"><span class="toc-item-num">6.9&nbsp;&nbsp;</span>Reset_index and set_index</a></span><ul class="toc-item"><li><span><a href="#SET_INDEX" data-toc-modified-id="SET_INDEX-6.9.1"><span class="toc-item-num">6.9.1&nbsp;&nbsp;</span>SET_INDEX</a></span></li></ul></li><li><span><a href="#Operations-between-columns" data-toc-modified-id="Operations-between-columns-6.10"><span class="toc-item-num">6.10&nbsp;&nbsp;</span>Operations between columns</a></span></li></ul></li><li><span><a href="#Apply-!" data-toc-modified-id="Apply-!-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Apply !</a></span></li><li><span><a href="#Df-.loc-&amp;-.iloc" data-toc-modified-id="Df-.loc-&amp;-.iloc-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Df .loc &amp; .iloc</a></span><ul class="toc-item"><li><span><a href="#Select-rows-and-columns-in-Pandas-by-position-with-iloc" data-toc-modified-id="Select-rows-and-columns-in-Pandas-by-position-with-iloc-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Select rows and columns in Pandas by position with iloc</a></span></li><li><span><a href="#Select-rows-and-columns-in-Pandas-based-on-labels-with-loc" data-toc-modified-id="Select-rows-and-columns-in-Pandas-based-on-labels-with-loc-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>Select rows and columns in Pandas based on labels with loc</a></span><ul class="toc-item"><li><span><a href="#Based-on-label" data-toc-modified-id="Based-on-label-8.2.1"><span class="toc-item-num">8.2.1&nbsp;&nbsp;</span>Based on label</a></span></li></ul></li></ul></li><li><span><a href="#Order-a-dataframe" data-toc-modified-id="Order-a-dataframe-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Order a dataframe</a></span><ul class="toc-item"><li><span><a href="#Look-for-null-values" data-toc-modified-id="Look-for-null-values-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>Look for null values</a></span><ul class="toc-item"><li><span><a href="#It-is-null?" data-toc-modified-id="It-is-null?-9.1.1"><span class="toc-item-num">9.1.1&nbsp;&nbsp;</span>It is null?</a></span></li><li><span><a href="#Is-NOT-null?" data-toc-modified-id="Is-NOT-null?-9.1.2"><span class="toc-item-num">9.1.2&nbsp;&nbsp;</span>Is NOT null?</a></span></li><li><span><a href="#Sum-the-null-values-​​of-each-column" data-toc-modified-id="Sum-the-null-values-​​of-each-column-9.1.3"><span class="toc-item-num">9.1.3&nbsp;&nbsp;</span>Sum the null values ​​of each column</a></span></li></ul></li><li><span><a href="#delete-null-values" data-toc-modified-id="delete-null-values-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span>delete null values</a></span></li><li><span><a href="#How-to-fill-in-the-missing-data" data-toc-modified-id="How-to-fill-in-the-missing-data-9.3"><span class="toc-item-num">9.3&nbsp;&nbsp;</span>How to fill in the missing data</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#CATEGORIES-IN-DATAFRAME:-DOCUMENTATION" data-toc-modified-id="CATEGORIES-IN-DATAFRAME:-DOCUMENTATION-9.3.0.1"><span class="toc-item-num">9.3.0.1&nbsp;&nbsp;</span>CATEGORIES IN DATAFRAME: DOCUMENTATION</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#We-delete-the-duplicates" data-toc-modified-id="We-delete-the-duplicates-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>We delete the duplicates</a></span></li><li><span><a href="#Data-aggregation" data-toc-modified-id="Data-aggregation-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Data aggregation</a></span><ul class="toc-item"><li><span><a href="#GroupBy" data-toc-modified-id="GroupBy-11.1"><span class="toc-item-num">11.1&nbsp;&nbsp;</span>GroupBy</a></span><ul class="toc-item"><li><span><a href="#You-may-ask,-what-if-I-want-to-group-by-more-columns?" data-toc-modified-id="You-may-ask,-what-if-I-want-to-group-by-more-columns?-11.1.1"><span class="toc-item-num">11.1.1&nbsp;&nbsp;</span>You may ask, what if I want to group by more columns?</a></span></li></ul></li><li><span><a href="#Union-of-Dataframes" data-toc-modified-id="Union-of-Dataframes-11.2"><span class="toc-item-num">11.2&nbsp;&nbsp;</span>Union of Dataframes</a></span></li><li><span><a href="#Concat" data-toc-modified-id="Concat-11.3"><span class="toc-item-num">11.3&nbsp;&nbsp;</span>Concat</a></span></li><li><span><a href="#Merge" data-toc-modified-id="Merge-11.4"><span class="toc-item-num">11.4&nbsp;&nbsp;</span>Merge</a></span></li><li><span><a href="#Join" data-toc-modified-id="Join-11.5"><span class="toc-item-num">11.5&nbsp;&nbsp;</span>Join</a></span></li></ul></li><li><span><a href="#Export-data" data-toc-modified-id="Export-data-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Export data</a></span></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Summary" data-toc-modified-id="Summary-14"><span class="toc-item-num">14&nbsp;&nbsp;</span>Summary</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-15"><span class="toc-item-num">15&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

# Pandas

![pandas](https://media.giphy.com/media/nVsLCrW5iHf6E/giphy.gif)

## Introduction
Pandas is undoubtedly the most widely used library in the Python ecosystem for data manipulation and analysis. It's fast, powerful, flexible, easy to use and open source.


Among its main features:

- A fast and efficient **DataFrame** object for data manipulation with built-in indexing* 

- **Reading and writing** of data in many formats: Microsoft Excel, CSV, SQL databases, etc;

- Integrated and efficient methods for all types of data manipulation: missing data, subset, union, merge, etc;

- Ease of working with temporary data (in fact, Pandas is named after "PANnel DAta")

- Good **integration with other data analysis or Machine learning libraries**: scikit-learn, scipy, seaborn, plotly, etc;

- It is **widely used** in both the private and academic sectors


Pandas provides high-level data structures and functions designed to make working with structured or tabular data fast, easy, and expressive. Since its introduction in 2010, it has helped make Python a powerful and productive data analysis environment. The main pandas objects that will be used in this book are the DataFrame, a column-oriented tabular data structure with row and column labels, and the Series, a labeled one-dimensional array object.

Pandas combines the high performance ideas of NumPy with the flexible data manipulation capabilities of spreadsheets and relational databases (such as SQL). It provides sophisticated indexing functionality to make it easy to reshape, slice and dice, perform aggregations, and select subsets of data.

![image](https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fgilpress%2Ffiles%2F2016%2F03%2FTime-1200x511.jpg)



Source: [Forbes](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#1ba071616f63)

## Installation

The first thing you should do will always be
`pip install pandas` (remember to activate your environment in case you need to)

In [1]:
import pandas as pd

## Introduction to pandas data structures
To get started with pandas, you'll need to get comfortable with its two working data structures: `Series` and `DataFrame`. Although they are not a universal solution to all problems, they provide a solid and easy-to-use foundation for most applications.

### Series
A Serie is a one-dimensional array object containing a sequence of values ​​(of NumPy-like types) and an associated array of data labels, called its index. The simplest Series is formed from a single array of data:

In [5]:
serie = pd.Series([1, 2, 3, "I can be a string", 0.3])
serie

0                    1
1                    2
2                    3
3    I can be a string
4                  0.3
dtype: object

In [6]:
type(serie)

pandas.core.series.Series

In [7]:
serie.values

array([1, 2, 3, 'I can be a string', 0.3], dtype=object)

In [11]:
list(serie.index)

[0, 1, 2, 3, 4]

The string representation of a Series displayed interactively shows the index on the left and the values ​​on the right. Since we didn't specify an index for the data, a default one consisting of the integers 0 to N - 1 (where N is the length of the data) is created. You can get the array representation and the index object of the Series through its values ​​and index attributes, respectively:

In [17]:
serie

0                    1
1                    2
2                    3
3    I can be a string
4                  0.3
dtype: object

In [69]:
my_dict = {"b": [1, 2, 3],
           "a": [4, 5, 5],
           "c": [3, 4, 5]
}

In [70]:
my_dict.keys()

dict_keys(['b', 'a', 'c'])

In [71]:
my_dict.values()

dict_values([[1, 2, 3], [4, 5, 5], [3, 4, 5]])

In [72]:
series_from_dict = pd.Series(my_dict)
display(series_from_dict)

b    [1, 2, 3]
a    [4, 5, 5]
c    [3, 4, 5]
dtype: object

In [73]:
type(series_from_dict)

pandas.core.series.Series

In [74]:
series_from_dict.index

Index(['b', 'a', 'c'], dtype='object')

In [75]:
list(series_from_dict.index)

['b', 'a', 'c']

Another way to think of a Series is as a fixed-length ordered dict, since it is a mapping of index values ​​to data values. It can be used in many contexts where a dictionary could be used.
If you have data contained in a Python dict, you can create a Series from it by passing the dict:

When only one dict is passed, the resulting String index will have the keys of the dict in order. You can override this by passing the keys of the dict in the order you want them to appear in the resulting String:

In [76]:
series_from_dict = pd.Series(my_dict, index=["a", "b", "c", "d"])
display(series_from_dict)

a    [4, 5, 5]
b    [1, 2, 3]
c    [3, 4, 5]
d          NaN
dtype: object

In [77]:
type(series_from_dict.loc["d"])

float

In [78]:
series_from_dict.iloc[1]

[1, 2, 3]

Here, the three values ​​found in sdata were placed in the appropriate places, but since no value was found for 'California', it appears as NaN (not a number), which is considered in pandas to mark missing values ​​or NA. Since "Utah" was not included in the states, it is excluded from the resulting object.

In [40]:
import numpy as np

### Find NaN values
NaN stands for Not A Number and is one of the common ways to represent the missing value in the data. It is a special floating point value and cannot be converted to a type other than float.
The NaN value is one of the main problems in data analysis. It is very essential to deal with NaN to get the desired results.

In [80]:
my_dict = {"b": [1, 2, 3],
           "a": [4, 5, 5],
           "c": [3, 4, 5]
}

In [100]:
df = pd.DataFrame ({"bcolumn": [1, 2, 3],
           "acolumn": [None, 5, 5],
           "ccolumn": [3, 4, None]
}, index=my_dict.keys())
df

   bcolumn  acolumn  ccolumn
b        1      NaN      3.0
a        2      5.0      4.0
c        3      5.0      NaN

In [105]:
df.isna()

   bcolumn  acolumn  ccolumn
b    False     True    False
a    False    False    False
c    False    False     True

In [102]:
np.nan

nan

In [95]:
type(np.nan)

float

In [106]:
pd.isnull(series_from_dict).sum()

1

## Read/write data

Pandas can read and write data from a wide variety of formats. [Read the documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
Although one of the most common is from a dict of lists of equal length or NumPy arrays:

In [97]:
df

   bcolumn  acolumn  ccolumn
b        1        4      3.0
a        2        5      4.0
c        3        5      NaN

In [99]:
df["acolumn"].ndim

1

In [107]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, np.nan]}

In [109]:
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  NaN

If I create a dataframe through a list of dictionaries:
- Each dictionary will be a row
- The keys will be the names of the columns
- They have to have the same structure

Since we are using Jupyter Notebook, pandas DataFrame objects will be displayed as a more browser-friendly HTML table.

In [113]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   6 non-null      object
 1   year    6 non-null      int64
 2   pop     5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 272.0+ bytes

In [115]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  NaN

In [123]:
df.loc[1]["state"] #index

'Ohio'

### We load data in CSV format

In [1]:
import pandas as pd
df = pd.read_csv("../datasets/avocado_kaggle.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    18249 non-null  int64
 1   Date          18249 non-null  object
 2   AveragePrice  18249 non-null  float64
 3   Total Volume  18249 non-null  float64
 4   4046          18249 non-null  float64
 5   4225          18249 non-null  float64
 6   4770          18249 non-null  float64
 7   Total Bags    18249 non-null  float64
 8   Small Bags    18249 non-null  float64
 9   Large Bags    18249 non-null  float64
 10  XLarge Bags   18249 non-null  float64
 11  type          18249 non-null  object
 12  year          18249 non-null  int64
 13  region        18249 non-null  object
dtypes: float64(9), int64(2), object(3)
memory usage: 1.9+ MB

In [3]:
df.shape

(18249, 14)

### We load data in xlsx format

In [4]:
#df = pd.read_excel("../datasets/Online Retail.xlsx")
#df.head()

### We display the first rows

In [5]:
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

By default head shows me the first 5 rows, I can see some more or less by passing a number as a parameter

In [6]:
df.head(7)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
5,5,2015-11-22,1.26,55979.78,1184.27,48067.99,43.61,6683.91,6556.47,127.44,0.0,conventional,2015,Albany
6,6,2015-11-15,0.99,83453.76,1368.92,73672.72,93.26,8318.86,8196.81,122.05,0.0,conventional,2015,Albany

### We display the last rows

In [7]:
df.tail()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

Exactly the same as with .head() we pass a parameter to .tail()

In [15]:
df.shape[0]

18249

In [17]:
sample_df = df.sample(frac=0.15)
sample_df.shape[0]

2737

### Visualize a random sample

In [18]:
df.sample(4)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
12678,17,2016-08-28,1.80,2178.75,577.74,790.08,0.00,810.93,726.67,84.26,0.0,organic,2016,GrandRapids
9457,19,2015-08-16,1.96,90240.43,24630.76,52035.43,0.00,13574.24,13574.24,0.00,0.0,organic,2015,California
2867,7,2016-11-06,1.29,393826.35,167083.47,65207.61,168.26,161367.01,82410.76,78956.25,0.0,conventional,2016,Atlanta
2212,28,2015-06-14,1.51,696873.03,181175.51,403173.66,32092.36,80431.50,79360.05,1071.45,0.0,conventional,2015,SanFrancisco

In [24]:
class DataFrame ():
    def __init__ (self, data, index=None, columns=None):
        pass

In [21]:
import pandas as pd
df = pd.DataFrame({"a":[1, 2, 3, 4], "b":[2, None, None, 5]})
df.head()

   a    b
0  1  2.0
1  2  NaN
2  3  NaN
3  4  5.0

In [22]:
df.describe(percentiles=[0.5, 0.10, 0.80])

              a        b
count  4.000000  2.00000
mean   2.500000  3.50000
std    1.290994  2.12132
min    1.000000  2.00000
10%    1.300000  2.30000
50%    2.500000  3.50000
80%    3.400000  4.40000
max    4.000000  5.00000

## Exploratory analysis of a dataframe

## Basic operations with dataframes

### We select a column

In [24]:
df = pd.read_csv("../datasets/avocado_kaggle.csv")
df.sample(6)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
1321,21,2015-08-02,1.14,2752081.97,532287.84,1359710.96,208419.92,651663.25,604227.70,46004.95,1430.60,conventional,2015,Midsouth
4613,37,2016-04-10,1.18,102684.74,1736.95,57325.73,1600.52,42021.54,28213.82,13807.72,0.00,conventional,2016,Pittsburgh
9240,10,2015-10-18,1.54,10215.96,772.28,6014.66,685.19,2743.83,913.31,1830.52,0.00,organic,2015,BaltimoreWashington
6815,33,2017-05-14,0.94,3551402.91,1376168.79,430527.04,88215.90,1656491.18,1602634.76,674.27,53182.15,conventional,2017,LosAngeles
12524,19,2016-08-14,0.86,90500.74,25938.55,334.11,0.00,64228.08,62542.16,1685.92,0.00,organic,2016,DallasFtWorth
2635,35,2015-04-26,1.19,304135.67,203078.44,19757.32,118.14,81181.77,60977.02,19915.86,288.89,conventional,2015,Tampa

In [32]:
df["Date"]

0        2015-12-27
1        2015-12-20
2        2015-12-13
3        2015-12-06
4        2015-11-29
            ...
18244    2018-02-04
18245    2018-01-28
18246    2018-01-21
18247    2018-01-14
18248    2018-01-07
Name: Date, Length: 18249, dtype: object

In [36]:
df[["Date", "4046"]]

             Date     4046
0      2015-12-27  1036.74
1      2015-12-20   674.28
2      2015-12-13   794.70
3      2015-12-06  1132.00
4      2015-11-29   941.48
...           ...      ...
18244  2018-02-04  2046.96
18245  2018-01-28  1191.70
18246  2018-01-21  1191.92
18247  2018-01-14  1527.63
18248  2018-01-07  2894.77

[18249 rows x 2 columns]

### We select several columns

In [37]:
copia = df.copy()

In [38]:
df is copia

False

In [39]:
df == copia

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,True,True,True,True,True,True,True,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,True,True,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,True,True,True,True,True,True,True,True,True,True,True,True,True,True
18245,True,True,True,True,True,True,True,True,True,True,True,True,True,True
18246,True,True,True,True,True,True,True,True,True,True,True,True,True,True
18247,True,True,True,True,True,True,True,True,True,True,True,True,True,True
18248,True,True,True,True,True,True,True,True,True,True,True,True,True,True

In [41]:
[element for element in dir(df) if "_" not in element]

['AveragePrice',
 'Date',
 'T',
 'abs',
 'add',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'attrs',
 'axes',
 'backfill',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'compare',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'flags',
 'floordiv',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'info',
 'insert',
 'interpolate',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pipe',
 'pivot',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'region',
 'reindex',
 'rename',
 'replace',
 'resample',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'sem',
 'shape',
 'shift',
 'size',
 'skew',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'type',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs',
 'year']

In [42]:
isinstance(df, pd.DataFrame)

True

In [61]:
df.drop(["Date"], axis=1)

KeyError: "['Date'] not found in axis"

### Get the unique values ​​of a column (ie a Series)

In [63]:
df.columns[3]

'4046'

In [66]:
list(df["4046"].unique())

[1036.74,
 674.28,
 794.7,
 1132.0,
 941.48,
 1184.27,
 1368.92,
 703.75,
 1022.15,
 842.4,
 924.86,
 1582.03,
 2268.32,
 1204.88,
 1028.03,
 985.73,
 879.45,
 689.01,
 733.16,
 539.65,
 584.63,
 509.94,
 648.75,
 1042.1,
 672.25,
 869.45,
 664.23,
 804.01,
 850.58,
 656.71,
 922.37,
 680.27,
 1150.55,
 1420.43,
 919.87,
 875.65,
 774.15,
 864.27,
 961.77,
 1402.28,
 2141.83,
 2128.26,
 795.68,
 629.46,
 1088.38,
 986.66,
 1357.37,
 1353.9,
 941.38,
 914.14,
 1002.85,
 2819.5,
 292097.36,
 251774.15,
 324932.28,
 283024.01,
 250288.65,
 269799.03,
 263915.78,
 250441.38,
 290457.5,
 236814.29,
 228710.28,
 255933.32,
 265797.09,
 262107.44,
 346118.51,
 278048.26,
 303113.24,
 275818.27,
 274462.42,
 362579.51,
 385027.71,
 306587.86,
 335372.02,
 446100.17,
 310080.33,
 436377.91,
 331353.43,
 449311.47,
 386370.5,
 455565.92,
 382900.99,
 538126.94,
 386400.89,
 413452.96,
 538403.48,
 387676.81,
 368709.65,
 377578.48,
 318473.47,
 305028.89,
 393591.03,
 336172.08,
 361559.22,
 441544.0,
 369316.29,
 364446.77,
 377256.38,
 553198.56,
 393408.17,
 372236.92,
 330411.24,
 364302.39,
 40450.49,
 44741.37,
 44400.26,
 51129.29,
 41028.15,
 40867.8,
 47109.75,
 58579.27,
 51860.07,
 53766.25,
 59121.55,
 34707.02,
 35342.34,
 34309.05,
 39619.87,
 55699.25,
 63903.73,
 48455.25,
 59242.02,
 86492.03,
 56362.75,
 53957.63,
 52746.41,
 52954.94,
 58827.99,
 66504.67,
 65051.95,
 58398.76,
 64005.15,
 62585.45,
 67744.84,
 63610.12,
 63515.06,
 79192.07,
 73038.46,
 58013.85,
 67486.78,
 70796.72,
 53579.17,
 58098.15,
 65158.96,
 53400.14,
 55284.8,
 59039.85,
 50501.07,
 49751.74,
 71703.52,
 93166.54,
 49696.14,
 49947.16,
 51460.64,
 53987.31,
 30482.25,
 25628.22,
 27148.61,
 35590.98,
 24189.98,
 25408.86,
 24424.72,
 31910.27,
 30434.99,
 29521.58,
 29614.23,
 26114.19,
 35154.43,
 47007.35,
 34826.9,
 45738.83,
 44134.65,
 40926.77,
 44059.22,
 46189.28,
 44739.54,
 51151.27,
 50978.38,
 45921.6,
 51828.75,
 61949.73,
 59111.33,
 52790.21,
 58791.25,
 61245.49,
 57373.57,
 54825.95,
 61319.66,
 62505.3,
 66880.12,
 69544.59,
 56843.62,
 44469.15,
 57339.81,
 59532.94,
 44227.33,
 51472.29,
 45879.84,
 40578.0,
 50872.0,
 41547.87,
 54229.34,
 67496.3,
 51922.06,
 50354.95,
 38112.34,
 44562.12,
 3886.27,
 4912.37,
 4641.02,
 5126.32,
 3609.25,
 4457.62,
 5310.32,
 5304.09,
 4886.14,
 4005.39,
 6409.86,
 5145.86,
 5804.31,
 5210.84,
 4376.74,
 5422.29,
 4237.44,
 4177.03,
 4744.11,
 4460.85,
 4173.23,
 4442.2,
 4299.27,
 4720.08,
 5332.07,
 4743.46,
 4688.28,
 3582.45,
 5104.19,
 4034.11,
 4128.35,
 4601.66,
 4285.68,
 4601.5,
 3828.64,
 3915.3,
 4013.71,
 3575.89,
 3657.54,
 3619.31,
 5956.18,
 6085.75,
 3425.53,
 4106.42,
 3232.68,
 3794.97,
 7653.19,
 6082.88,
 4730.77,
 4383.76,
 5548.11,
 7193.87,
 1367.81,
 1164.92,
 1421.12,
 1737.71,
 1514.69,
 1711.77,
 1803.78,
 1288.83,
 2181.17,
 1545.57,
 1536.35,
 2170.49,
 3020.03,
 1908.16,
 1445.25,
 1572.71,
 1471.69,
 1406.11,
 1287.09,
 1230.78,
 1139.74,
 1447.81,
 1679.28,
 1165.75,
 1119.38,
 1503.1,
 1235.69,
 1254.83,
 1183.9,
 779.02,
 1039.49,
 1033.76,
 932.52,
 1321.83,
 946.38,
 1117.56,
 1021.72,
 884.02,
 969.27,
 1352.63,
 3090.55,
 3500.48,
 1072.46,
 1032.92,
 1709.23,
 1520.76,
 1822.41,
 2117.73,
 1321.19,
 1625.26,
 1642.25,
 3267.97,
 1833946.59,
 1676601.43,
 1806690.08,
 1943065.5,
 1461699.38,
 1602215.57,
 2243013.44,
 2317858.81,
 2369824.75,
 1733791.31,
 1847991.31,
 1757211.58,
 1461112.39,
 1860050.39,
 1702965.49,
 1863270.81,
 2859325.91,
 3104607.82,
 2626977.95,
 3098708.55,
 3260775.73,
 2940145.82,
 3112921.78,
 2805887.74,
 2747299.98,
 3581149.88,
 3163839.74,
 3328631.93,
 4075881.34,
 3614314.44,
 3620440.35,
 2978396.74,
 2923673.93,
 4085858.78,
 4340117.03,
 2421009.67,
 3024466.22,
 2848184.0,
 2754464.87,
 2609532.63,
 2348618.25,
 2962520.41,
 3484274.6,
 3516551.29,
 3210177.22,
 3315163.6,
 2908845.38,
 4794142.14,
 2380955.61,
 2780859.66,
 2889591.29,
 2843648.26,
 33070.27,
 29500.04,
 31727.46,
 34117.36,
 31911.11,
 30028.69,
 28543.88,
 30860.74,
 33371.6,
 23093.86,
 22805.02,
 22941.59,
 23648.94,
 24397.92,
 25922.66,
 30122.92,
 35126.74,
 33511.97,
 32280.63,
 32128.6,
 29915.8,
 30200.32,
 30901.1,
 33382.11,
 23580.7,
 30803.29,
 23693.74,
 30951.17,
 31247.67,
 43524.21,
 45688.14,
 43628.72,
 44340.34,
 47626.37,
 50203.31,
 39481.13,
 38330.46,
 48793.38,
 43112.4,
 34498.06,
 41638.46,
 39138.41,
 29980.15,
 45465.24,
 44679.57,
 28227.83,
 31509.41,
 52915.5,
 37383.37,
 26462.87,
 31586.35,
 29419.03,
 42799.0,
 35724.99,
 40380.09,
 53173.18,
 42851.47,
 34868.5,
 31286.11,
 44528.42,
 69420.04,
 59161.08,
 25883.13,
 16455.46,
 14268.84,
 16483.95,
 16477.56,
 17172.26,
 17595.54,
 17363.14,
 17595.95,
 19193.94,
 18237.36,
 21607.12,
 26653.29,
 20534.84,
 22933.92,
 28422.72,
 27391.54,
 34715.08,
 55227.59,
 51410.51,
 50563.81,
 57568.25,
 54087.8,
 55587.31,
 64798.64,
 46749.43,
 52850.1,
 45103.98,
 38641.17,
 25629.52,
 29308.0,
 30100.78,
 27489.32,
 24137.05,
 39072.26,
 29711.82,
 28216.83,
 50783.91,
 26117.56,
 24917.77,
 31239.94,
 30270.26,
 2633.37,
 2732.05,
 3802.6,
 2914.81,
 2399.32,
 2565.81,
 2680.0,
 2979.02,
 2998.18,
 2264.65,
 2297.3,
 2251.48,
 2132.57,
 2220.62,
 3127.8,
 2195.13,
 2462.55,
 2623.58,
 2750.77,
 2472.69,
 2357.57,
 2443.41,
 2474.11,
 3726.35,
 3503.25,
 3238.38,
 3691.48,
 3795.3,
 6856.14,
 10630.01,
 10459.41,
 10258.51,
 10239.98,
 11982.39,
 11468.92,
 8217.17,
 8229.4,
 11176.67,
 7516.57,
 3014.53,
 2968.26,
 3550.62,
 3470.71,
 3610.46,
 4431.56,
 4399.26,
 4246.12,
 4665.89,
 3617.45,
 3333.29,
 3612.86,
 3274.3,
 41808.54,
 57557.75,
 69742.59,
 60376.23,
 40352.94,
 50334.8,
 52474.75,
 61494.68,
 58162.23,
 59745.47,
 62590.79,
 57480.41,
 53606.35,
 66587.59,
 86031.9,
 86159.05,
 61052.61,
 64531.04,
 64597.94,
 63291.37,
 64121.12,
 77973.44,
 91758.41,
 75080.98,
 69964.42,
 79063.5,
 72752.84,
 67311.23,
 83138.56,
 92110.97,
 80729.03,
 85510.9,
 97341.26,
 97879.64,
 79998.58,
 87214.58,
 80303.92,
 66513.95,
 67298.39,
 72473.25,
 101143.03,
 90582.35,
 56323.87,
 55610.59,
 56131.64,
 52221.93,
 76792.99,
 111171.46,
 53201.66,
 55532.76,
 64726.71,
 80298.77,
 494425.64,
 439792.68,
 476178.99,
 514160.41,
 477944.48,
 494872.79,
 642897.96,
 563069.05,
 546040.25,
 557469.46,
 570732.49,
 543166.98,
 491729.14,
 533088.33,
 606586.38,
 564967.74,
 626166.71,
 674670.89,
 679440.88,
 718594.72,
 674531.14,
 705846.27,
 661845.98,
 684455.16,
 713425.63,
 835215.79,
 760374.24,
 755351.26,
 1013252.58,
 788982.74,
 941838.33,
 775365.99,
 855871.73,
 817727.07,
 652304.49,
 717960.82,
 735235.09,
 871511.12,
 802917.65,
 645523.05,
 925527.04,
 726176.09,
 724775.83,
 665032.82,
 695493.39,
 625813.98,
 737968.75,
 786166.9,
 649344.32,
 627090.61,
 680572.11,
 612795.8,
 93034.2,
 113403.55,
 96222.34,
 111259.34,
 85241.45,
 100047.56,
 98269.82,
 113964.9,
 140330.11,
 106239.17,
 117059.41,
 108538.74,
 101712.18,
 119089.66,
 85382.01,
 115935.68,
 138154.55,
 119849.97,
 135261.61,
 157630.43,
 131770.05,
 153498.68,
 138942.76,
 119266.12,
 123673.43,
 146171.45,
 162885.58,
 184206.21,
 194447.12,
 167992.06,
 127747.5,
 198187.29,
 156010.24,
 148762.57,
 182975.49,
 160372.05,
 129744.18,
 176304.23,
 156966.84,
 160679.31,
 131881.99,
 160422.27,
 118578.11,
 101528.39,
 153410.25,
 116907.81,
 153584.14,
 217715.85,
 140914.23,
 151976.7,
 110974.25,
 117454.09,
 83097.26,
 110507.5,
 132206.07,
 92957.56,
 84236.03,
 95526.76,
 88132.72,
 103367.05,
 112432.15,
 84318.99,
 117479.44,
 110374.23,
 81617.68,
 88573.56,
 129945.11,
 151274.05,
 143927.73,
 177827.49,
 114208.75,
 113822.13,
 136799.68,
 157018.49,
 119084.73,
 125844.19,
 127995.39,
 140339.02,
 135230.94,
 133405.45,
 136802.87,
 153214.87,
 162243.06,
 193348.39,
 214237.95,
 177872.77,
 161288.26,
 133322.95,
 140434.29,
 96441.78,
 113210.53,
 120782.43,
 138397.72,
 107980.24,
 97420.1,
 97605.68,
 99207.09,
 100594.59,
 129910.26,
 205775.28,
 110113.35,
 113616.86,
 108378.69,
 121634.27,
 2992.62,
 2630.11,
 3809.88,
 4026.57,
 3726.77,
 3734.97,
 3490.77,
 3970.87,
 3731.64,
 3899.73,
 3821.47,
 3638.99,
 3241.7,
 2977.77,
 3612.73,
 4113.5,
 3673.53,
 3931.2,
 4847.16,
 5134.58,
 4807.41,
 4122.95,
 3192.59,
 2680.7,
 4663.59,
 2709.26,
 3089.5,
 2552.14,
 4446.1,
 6926.42,
 7097.0,
 7888.33,
 5515.43,
 7383.85,
 6301.92,
 4480.46,
 5547.29,
 5875.73,
 4487.21,
 1977.68,
 1930.32,
 1621.03,
 1783.51,
 1355.2,
 1593.4,
 1659.05,
 1155.67,
 1621.68,
 1112.09,
 970.13,
 972.96,
 1097.0,
 336673.7,
 383701.76,
 463349.67,
 401676.14,
 318661.4,
 347803.29,
 342002.87,
 410061.0,
 436343.74,
 383559.81,
 396690.54,
 355508.86,
 296032.66,
 343271.52,
 460475.95,
 492741.15,
 432770.76,
 478858.03,
 404182.26,
 414756.68,
 420919.7,
 490577.01,
 475306.73,
 449090.82,
 456044.5,
 502233.05,
 476721.82,
 487936.68,
 604782.48,
 689242.14,
 667193.97,
 758183.5,
 787079.55,
 766730.7,
 719493.66,
 609506.22,
 615564.03,
 548501.37,
 504487.79,
 456518.93,
 543151.72,
 475449.58,
 380674.2,
 353818.94,
 391400.93,
 390973.21,
 515789.01,
 768874.35,
 390289.67,
 401683.43,
 416900.3,
 467259.47,
 22694.58,
 24111.34,
 27053.78,
 25260.16,
 23707.06,
 26601.95,
 25483.85,
 27837.88,
 28916.15,
 27595.5,
 27640.26,
 32042.53,
 32554.49,
 30410.27,
 31925.36,
 33047.61,
 37453.63,
 34595.95,
 37213.9,
 37089.49,
 40320.2,
 40387.93,
 39346.13,
 42405.8,
 42200.05,
 49829.42,
 42688.0,
 44179.19,
 42766.16,
 40587.95,
 42572.44,
 43499.81,
 44842.47,
 53021.23,
 46183.27,
 45102.26,
 45693.41,
 35513.59,
 35705.85,
 31891.81,
 28701.47,
 31225.82,
 38517.23,
 28899.98,
 32241.22,
 28592.73,
 35933.38,
 42732.12,
 33193.27,
 30928.18,
 34535.57,
 32679.84,
 4427.27,
 4806.75,
 4439.86,
 4269.91,
 3572.7,
 3720.08,
 4680.06,
 5048.2,
 4471.3,
 3444.57,
 4980.03,
 4555.33,
 5369.78,
 3978.86,
 3716.84,
 4326.64,
 3976.35,
 3882.25,
 4337.08,
 4402.25,
 4619.78,
 4543.97,
 3579.93,
 3759.04,
 4947.35,
 4847.8,
 4253.95,
 4030.52,
 4926.58,
 4435.64,
 4974.69,
 4532.15,
 4623.9,
 5262.94,
 4005.44,
 4159.5,
 3625.55,
 3432.34,
 4021.27,
 3980.5,
 5900.6,
 6740.23,
 3253.02,
 4547.97,
 3632.57,
 3681.09,
 6791.17,
 4803.72,
 4305.86,
 3347.41,
 4365.27,
 6387.6,
 389773.22,
 382444.22,
 412187.8,
 368528.91,
 391616.95,
 402191.51,
 530464.33,
 427828.16,
 395945.0,
 437329.85,
 436132.2,
 410949.18,
 411727.49,
 383218.43,
 417701.88,
 421533.83,
 460377.08,
 559048.7,
 509472.17,
 565965.79,
 474778.09,
 568694.81,
 522819.52,
 517797.01,
 559622.59,
 652959.91,
 613485.76,
 578767.93,
 924661.29,
 675888.37,
 757230.93,
 662438.33,
 676510.74,
 654227.6,
 651055.45,
 689172.94,
 566197.65,
 631292.63,
 608887.6,
 502389.02,
 514614.47,
 526390.61,
 507328.95,
 481279.09,
 520034.92,
 571823.28,
 525259.71,
 540024.17,
 549415.32,
 458532.19,
 463272.52,
 506426.58,
 4647.28,
 3702.2,
 4904.51,
 4067.0,
 3079.44,
 3979.57,
 3478.99,
 4337.57,
 5224.61,
 4333.17,
 4397.88,
 4270.64,
 ...]

In [ ]:
dr.drop(column, axis=1)

df.drop(0)

In [68]:
df.head(3)

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany

In [70]:
df.drop(1, axis=0).head(3)

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
2,2,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany

In [72]:
df.head(3)

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany

### Change the data type of a column

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    18249 non-null  int64
 1   AveragePrice  18249 non-null  float64
 2   Total Volume  18249 non-null  float64
 3   4046          18249 non-null  float64
 4   4225          18249 non-null  float64
 5   4770          18249 non-null  float64
 6   Total Bags    18249 non-null  float64
 7   Small Bags    18249 non-null  float64
 8   Large Bags    18249 non-null  float64
 9   XLarge Bags   18249 non-null  float64
 10  type          18249 non-null  object
 11  year          18249 non-null  int64
 12  region        18249 non-null  object
dtypes: float64(9), int64(2), object(2)
memory usage: 1.8+ MB

### We filter the data by the value of the columns

### Copy a dataframe and rename columns

#### Rename columns
To rename columns we need a dictionary

The rename method allows me to rename only the columns that I want, the ones that are in the dictionary. No need to rename all at once

#### We can rename the columns by crushing the instance attribute... does this ring a bell?
Requires a list with the same number of columns

### delete columns

### delete rows

Rows can also be deleted. Note that the indexes are not reset. The index is associated with the row, not the order.
Can the index be restarted? Correct

### Reset_index and set_index

We read the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html) to understand some parameters

#### SET_INDEX

What can we use to have the date as an index?
We will see it later, to analyze temporary series

### Operations between columns

## Apply !

Applies a function along an axis of the DataFrame.
[Read the docs](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)

When I do an apply on a column, even though I use a lambda, I don't put axis because in the case below, what I'm doing is modifying a column, I use lambda to tell the apply that the first argument is a string that comes from outside and the second argument is the dataframe's own record.

## Df .loc & .iloc

### Select rows and columns in Pandas by position with iloc

The iloc method is used on DataFrames to select elements based on their location. Its syntax is data.iloc[<filas>, <columnas>], where <filas> and <columnas> are the position of the rows and columns that you want to select in the order that they appear in the object. A familiar notation for Matlab users. In a DataFrame, each of the rows has a number that goes from 0 to the total number of rows minus one. Being iloc the method that allows selecting the data based on these numbers. The same applies to columns.

In iloc there are two arguments rows and columns. In case the second is omitted, all columns in the row will be selected. So to select different rows can be used.

### Select rows and columns in Pandas based on labels with loc
The loc method can be used in two different ways: select rows or columns based on a label, or select rows or columns based on a condition.

#### Based on label

## Order a dataframe

loc syntax with multiple conditions
```python
df.loc[(df["column"] condition) & (df["column"] condition)]
````

Same operation, but give me only concrete columns

### Look for null values

#### It is null?

#### Is NOT null?

#### Sum the null values ​​of each column

### delete null values
There are several ways to do this, we take into account the "how" parameter and of course [the docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html).

REMEMBER THAT INPLACE TRUE IS FOR THE METHOD TO ACTION ON THE DF, IF NOT, I HAVE TO SAVE IT IN A NEW VARIABLE

With "any" (parameter that comes by default so be careful not to put anything) all the records in which there is a NaN in any column are deleted

### How to fill in the missing data

How about a little [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html)?

##### CATEGORIES IN DATAFRAME: DOCUMENTATION
https://runebook.dev/en/docs/pandas/user_guide/categorical

## We delete the duplicates

## Data aggregation
### GroupBy
Pandas GroupBy is a powerful and versatile function in Python. It allows us to split your data into separate groups to perform calculations for better analysis.
A DataFrame can be grouped on its rows (axis=0) or on its columns (axis=1). Once this is done, a function is applied to each group, producing a new value. Finally, the results of all those function applications are combined into a result object. The shape of the resulting object will usually depend on what is done with the data.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html

In [75]:
df

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [25]:
df["AveragePrice"].groupby(df[["type", "region"]]).mean()

KeyError: 'AveragePrice'

In [27]:
#df["AveragePrice"].groupby(df[["type", "region"]]).mean()


df.groupby(["type", "region"]).agg({"AveragePrice":"mean"})

KeyError: 'type'

In [ ]:
df["AveragePrice"].groupby(df["type"]).mean()

In [91]:
df.columns

Index(['Unnamed: 0', 'AveragePrice', 'Total Volume', '4046', '4225', '4770',
       'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type', 'year',
       'region'],
      dtype='object')

In [92]:
df[["AveragePrice", "Small Bags"]].groupby(df["type"]).mean()

              AveragePrice     Small Bags
type
conventional      1.158040  346721.795885
organic           1.653999   17613.474543

In [29]:
df[["AveragePrice", "Small Bags"]].groupby(df["type"]).mean()

KeyError: "None of [Index(['AveragePrice', 'Small Bags'], dtype='object')] are in the [columns]"

In [28]:
#df[["AveragePrice", "Small Bags"]].groupby(df["type"]).mean()

df.groupby(df["type"]).agg({"Small Bags":"mean", "AveragePrice":"sum"})

KeyError: 'type'

In [118]:
hey = df[["AveragePrice", "Total Volume", "type", "region"]]

In [119]:
hey.groupby(["type", "region"]).mean()

                                  AveragePrice   Total Volume
type         region
conventional Albany                   1.348757   92903.026450
             Atlanta                  1.068817  512789.298817
             BaltimoreWashington      1.344201  773642.458166
             Boise                    1.076036   82843.434911
             Boston                   1.304379  561541.054083
...                                        ...            ...
organic      Syracuse                 1.653728    2666.716213
             Tampa                    1.616095    4238.266568
             TotalUS                  1.546036  967565.653491
             West                     1.559349  221411.634379
             WestTexNewMexico         1.688855   15271.713193

[108 rows x 2 columns]

In [126]:
group_2 = df.groupby(["type", "region"]).agg({"Total Volume":"mean", "AveragePrice": "sum"})
group_2

                                   Total Volume  AveragePrice
type         region
conventional Albany                92903.026450        227.94
             Atlanta              512789.298817        180.63
             BaltimoreWashington  773642.458166        227.17
             Boise                 82843.434911        181.85
             Boston               561541.054083        220.44
...                                         ...           ...
organic      Syracuse               2666.716213        279.48
             Tampa                  4238.266568        273.12
             TotalUS              967565.653491        261.28
             West                 221411.634379        263.53
             WestTexNewMexico      15271.713193        280.35

[108 rows x 2 columns]

Suppose we want to calculate the mean of column data1 using the labels of key1. There are several ways to do it. One is to access data1 and call groupby with the column (a String) in key1.
The data (a Series) has been aggregated based on the group key, producing a new String that is now indexed by the unique values ​​of the key1 column. The resulting index has the name 'key1' because the DataFrame column `df['key1']` did.

#### You may ask, what if I want to group by more columns?

In [3]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [45]:
df.groupby(["sex","class"])["age"].mean()

sex     class
female  First     34.611765
        Second    28.722973
        Third     21.750000
male    First     41.281386
        Second    30.740707
        Third     26.507589
Name: age, dtype: float64

In [52]:
df["age"].isna().sum()

177

In [57]:
df["age"] = df.groupby(["sex", "class"])["age"].apply(lambda x: x.fillna(x.mean()))

In [58]:
df["age"].isna().sum()

0

In [59]:
df.groupby(["sex", "class"]).agg({"age": "mean"})

                     age
sex    class
female First   34.611765
       Second  28.722973
       Third   21.750000
male   First   41.281386
       Second  30.740707
       Third   26.507589

In [60]:
df.groupby(["sex", "class"]).agg({"age": "mean"})

                     age
sex    class
female First   34.611765
       Second  28.722973
       Third   21.750000
male   First   41.281386
       Second  30.740707
       Third   26.507589

In [23]:
df.groupby(["sex", "class"]).agg({"age":"mean"})

df.groupby(CAT).agg(CUANT).calculate

df.CUANT.groupby(CAT)


df.📐.groupby(🐈)

                     age
sex    class
female First   34.611765
       Second  28.722973
       Third   21.750000
male   First   41.281386
       Second  30.740707
       Third   26.507589

In [7]:
df["new"] = df.groupby(["sex", "class"])["age"].apply(lambda x: x.fillna(x.mean()))

In [ ]:
df["hola"]

In [13]:
df["age"].isna().sum()

177

In [12]:
df["new"].isna().sum()

0

In [14]:
df["age"].mean() #with nan values

29.69911764705882

In [15]:
df["new"].mean() #without nan values

29.318642716644145

Another way to groupby with agg syntax
https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.aggregate.html

- mean
- sum
-count

### Union of Dataframes
- https://realpython.com/pandas-merge-join-and-concat/
- https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html


### Concat
We join dataframes along axis 0 one below the other. Align columns by label.

### Merge

[Merge()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html) is most useful when you want to merge rows that share data.

# When the data does not match

### Join
The join, unlike the merge, will join the dataframes and where there are no records in the "index" it will put NaN

## Export data

## Pandas usual methods
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.info(memory_usage='deep')
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values ​​of a column
df.col.unique() # returns unique values ​​from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Summary
It's your turn, what have we learned today?

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)